<a id='Q0'></a>
<center> <h1> Notebook 1: Effective Pandas - Notes and Exercises </h1> </center>
<p style="margin-bottom:1cm;"></p>
<center><strong>Angela Niederberger, 2022</strong></center>
<p style="margin-bottom:1cm;"></p>

<div style="background:#EEEDF5;border-top:0.1cm solid #EF475B;border-bottom:0.1cm solid #EF475B;">
    <div style="margin-left: 0.5cm;margin-top: 0.5cm;margin-bottom: 0.5cm;color:#303030">
        <p><strong>Goal:</strong> Study notes, exercises and learnings from the book 'Effective Pandas' by Matt Harrison</p>
        <strong> Outline:</strong>
        <a id='P0' name="P0"></a>
        <ul>
            <li> <a style="color:#303030" href='#SU'>Set up</a></li>
            <li> <a style="color:#303030" href='#P1'>Chapter 1: Introduction</a></li>
            <li> <a style="color:#303030" href='#P2'>Chapter 2: Installation</a></li>
            <li> <a style="color:#303030" href='#P3'>Chapter 3: Data Structures</a></li>
            <li> <a style="color:#303030" href='#P4'>Chapter 4: Series Introduction</a></li>
            <li> <a style="color:#303030" href='#P5'>Chapter 5: Series Deep Dive</a></li>
            <li> <a style="color:#303030" href='#P6'>Chapter 6: Operators (& Dunder Methods)</a></li>
            <li> <a style="color:#303030" href='#P7'>Chapter 7: Aggregate Methods</a></li>
            <li> <a style="color:#303030" href='#P8'>Chapter 8: Conversion Methods</a></li>
            <li> <a style="color:#303030" href='#P9'>Chapter 9: Manipulation Methods</a></li>
            <li> <a style="color:#303030" href='#P10'>Chapter 10: Indexing Operations</a></li>
            <li> <a style="color:#303030" href='#P11'>Chapter 11: String Manipulation</a></li>
            <li> <a style="color:#303030" href='#P12'>Chapter 12: Date and Time Manipulation</a></li>
        </ul>
        <strong>Keywords:</strong> python, pandas, good practice, study notes
    </div>
</div>
</nav>

<a id='SU' name="SU"></a>
## [Set up](#P0)

These study notes are based on the book **Effective Pandas** by [Matt Harrison](https://github.com/mattharrison). If you want to learn more, get your copy [here](https://store.metasnake.com/effective-pandas-book).

<img src="../reports/img/book_cover.jpg" width=300/>

### Packages

In [1]:
import pandas as pd
import numpy as np
import copy

### Data

In [2]:
url = "https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip"
df = pd.read_csv(url, low_memory=False)
city_mpg = df["city08"]
highway_mpg = df["highway08"]

<a id='P1'></a>
## [Chapter 1: Introduction](#P0)

<a id='P2'></a>
## [Chapter 2: Installation](#P0)

<a id='P3'></a>
## [Chapter 3: Data Structures](#P0)

### Notes

### Exercises

<a id='P4'></a>
## [Chapter 4: Series Introduction](#P0)

### Notes

### Exercises

1. Using Jupyter, create a series with the temperature values for the last seven days. Filter out the values below the mean.

In [3]:
temp_values = pd.Series([-3.0, -1.5, 3, 0, 2, 5, -1])
print(temp_values.mean())

0.6428571428571429

In [4]:
temp_values[temp_values<temp_values.mean()]

0   -3.0
1   -1.5
3    0.0
6   -1.0
dtype: float64

2. Using Jupyter, create a series with your favorite colors. Use a categorical type.

In [5]:
fav_colors = pd.Series(["blue", "yellow", "turquoise"], dtype="category")
fav_colors

0         blue
1       yellow
2    turquoise
dtype: category
Categories (3, object): ['blue', 'turquoise', 'yellow']

<a id='P5'></a>
## [Chapter 5: Series Deep Dive](#P0)

### Notes

We can check out the attributes of a specific object by using ``dir()``.

In [6]:
city_mpg

0        19
1         9
2        23
3        10
4        17
         ..
41139    19
41140    20
41141    18
41142    18
41143    16
Name: city08, Length: 41144, dtype: int64

In [7]:
len(dir(city_mpg))

420

### Exercises

1. Explore the documentation for five attributes of a series from Jupyter.

In [8]:
city_mpg.add(-100)

0       -81
1       -91
2       -77
3       -90
4       -83
         ..
41139   -81
41140   -80
41141   -82
41142   -82
41143   -84
Name: city08, Length: 41144, dtype: int64

In [9]:
# Compute correlation between series and itself shifted by i

city_mpg.autocorr(2)

0.29762739792527215

In [10]:
# Compute correlation with another series

city_mpg.corr(highway_mpg)

0.939365413064056

In [11]:
# apply a function on the series

city_mpg.transform("sqrt")

0        4.358899
1        3.000000
2        4.795832
3        3.162278
4        4.123106
           ...
41139    4.358899
41140    4.472136
41141    4.242641
41142    4.242641
41143    4.000000
Name: city08, Length: 41144, dtype: float64

In [12]:
# index according to position

city_mpg.take([1, 66, 3987])

1        9
66      16
3987    15
Name: city08, dtype: int64

In [13]:
# Check if Series is monotonically increasing

city_mpg.is_monotonic

False

In [14]:
# method that counts number of unique values
print(f"{city_mpg.nunique()}, same as {len(city_mpg.unique())}")

105, same as 105

2. How many attributes are found on the ``.str`` attribute? Look at the documentation for three of them.

In [15]:
len(dir(fav_colors.str))

99

In [16]:
fav_colors.str.startswith("t")

0    False
1    False
2     True
dtype: bool

In [17]:
# Add linebreaks after certain number of characters

for col in fav_colors.str.wrap(7):
    print(col)

blue
yellow
turquoi
se

In [18]:
# Split strings at last occurrence of separator

fav_colors.str.rpartition("u")

      0  1       2
0    bl  u       e
1           yellow
2  turq  u    oise

In [19]:
fav_colors.str.join("-")

0              b-l-u-e
1          y-e-l-l-o-w
2    t-u-r-q-u-o-i-s-e
dtype: object

3. How many attributes are found on the ``.dt`` attribute? Look at the documentation for three of them.

In [20]:
dates = pd.Series(["01.01.2021", "14.04.1987", "26.12.1977"], dtype = "datetime64[ns]")

/home/angela/anaconda3/envs/effective_pandas/lib/python3.8/site-packages/pandas/core/dtypes/cast.py:1619: UserWarning: Parsing '14.04.1987' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  dta = sequence_to_datetimes(value)
/home/angela/anaconda3/envs/effective_pandas/lib/python3.8/site-packages/pandas/core/dtypes/cast.py:1619: UserWarning: Parsing '26.12.1977' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  dta = sequence_to_datetimes(value)

In [21]:
len(dir(dates.dt))

83

In [22]:
# month property
dates.dt.month

0     1
1     4
2    12
dtype: int64

In [23]:
# method that returns names of weekdays
dates.dt.day_name()

0     Friday
1    Tuesday
2     Monday
dtype: object

In [24]:
# month start property
dates.dt.is_month_start

0     True
1    False
2    False
dtype: bool

In [25]:
# method that returns the corresponding time period
dates.dt.to_period("M")

0    2021-01
1    1987-04
2    1977-12
dtype: period[M]

<a id='P6'></a>
## [Chapter 6: Operators (& Dunder Methods)](#P0)

### Notes

In pure Python, there's a thing called **Dunder Methods** which start and end with a double underscore (e.g. `.__add__`). Pandas Series have some of these methods as well. Therefore they support operations such as division.

To use such methods on two series together (e.g. `Series_1 + Series_2`), they need to have indexes that are **unique** and **common** to both series. The operation is then broadcast to the entire series at once (vectorization), which is very efficient.

There is also a `.__iter__` method that can be used to loop through a series. However, this is usually not recommended, since there are more efficient ways to do most things.

Pandas also provides **Operator Methods** (`s1.add(s2)`) besides the pure Python ones (`s1+s2`). There it is possible to specify additional parameters, e.g. `fill_value=0` instead of the default `NA`. Also, operator methods can be chained together (`s1.add(s2, fill_value=0).div(2)`), which is very useful and readable. Basically all common arithmetic and boolean operations are available as pandas methods.

### Exercises

With a dataset of your choice:

In [26]:
url = "https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip"
df = pd.read_csv(url, low_memory=False)
city_mpg = df["city08"]
highway_mpg = df["highway08"]

1. Add a numeric series to itself.

In [27]:
city_mpg.head()

0    19
1     9
2    23
3    10
4    17
Name: city08, dtype: int64

In [28]:
city_mpg + city_mpg

0        38
1        18
2        46
3        20
4        34
         ..
41139    38
41140    40
41141    36
41142    36
41143    32
Name: city08, Length: 41144, dtype: int64

2. Add 10 to a numeric series.

In [29]:
city_mpg + 10

0        29
1        19
2        33
3        20
4        27
         ..
41139    29
41140    30
41141    28
41142    28
41143    26
Name: city08, Length: 41144, dtype: int64

3. Add a numeric series to itself using the `.add` method.

In [30]:
city_mpg.add(city_mpg).head()

0    38
1    18
2    46
3    20
4    34
Name: city08, dtype: int64

4. Read the documentation for the `.add` method.

<a id='P7'></a>
## [Chapter 7: Aggregate Methods](#P0)

### Notes

There are aggregate methods (e.g. `.mean()`) which return a scalar and aggregate properties (e.g. `.is_unique`) which return a boolean.

A couple of useful tricks:
- We can filter with boolean methods (see previous chapter) and then count with `.sum()` or get the percentage with `.mul(100).mean()`.

In [31]:
# How many cars have city mpg greater than 20?
print(city_mpg.gt(20).sum())
print(city_mpg.gt(20).mul(100).mean(), "%")

10272
24.965973167412017 %

- `.quantile()` returns the median (50% quantile) by default, but it also accepts a list of levels and returns a series.

In [32]:
print(city_mpg.quantile())
print("Levels:\n", city_mpg.quantile([0.1, 0.5, 0.9]))

17.0
Levels:
 0.1    13.0
0.5    17.0
0.9    24.0
Name: city08, dtype: float64

- `.agg()` accepts a list of aggregation functions (can be pandas, pure python, numpy, own,...) and returns a series.

In [33]:
import numpy as np

def return_second_last(series):
    return series.iloc[-2]

print(city_mpg.agg(["mean", max, np.var, return_second_last]))

mean                   18.369045
max                   150.000000
var                    62.503036
return_second_last     18.000000
Name: city08, dtype: float64

### Exercises

With a dataset of your choice:

In [34]:
url = "https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip"
df = pd.read_csv(url, low_memory=False)
city_mpg = df["city08"]
highway_mpg = df["highway08"]

1. Find the count of non-missing values of a series.

In [35]:
# Count ignores missing values
highway_mpg.count()

41144

In [36]:
# There are none anyway
highway_mpg.isna().sum()

0

In [37]:
highway_mpg.hasnans

False

2. Find the number of entries of a series.

In [38]:
highway_mpg.size

41144

In [39]:
# Add a missing value
highway_mpg_2 = pd.concat([highway_mpg, pd.Series([np.nan])])

In [40]:
# Check count and size again
print(highway_mpg_2.count())
print(highway_mpg_2.size)

41144
41145

3. Find the number of unique entries of a series.

In [41]:
highway_mpg.nunique()

92

4. Find the mean value of a series.

In [42]:
highway_mpg.mean()

24.504666537040638

5. Find the maximum value of a series.

In [43]:
highway_mpg.max()

124

6. Use the `.agg` method to find all of the above.

In [44]:
highway_mpg.agg(["count", "size", "nunique", "mean", max])

count      41144.000000
size       41144.000000
nunique       92.000000
mean          24.504667
max          124.000000
Name: highway08, dtype: float64

<a id='P8'></a>
## [Chapter 8: Conversion Methods](#P0)

### Notes

It is useful to have control over the type of data in a series. Using the correct type can save a lot of memory. These are the most relevant methods:

- `.convert_dtypes()`: tries to convert data to a type that allows `pd.NA`
- `.astype()`: convert to a specific type
- `.nbytes` (property): gives the amount of memory that the data is using
- `.memory_usage()`: includes also the *make* of the object (e.g. index) etc.

Good to know:

- Strings saved as strings use much more memory than strings saved as categories.
- `.to_numpy()` or `.values` gives a numpy array, `.to_list` returns a python list. NumPy can sometimes speed up the code, while python lists tend to slow it down. `.to_frame()` turns a Series into a DataFrame.
- For dates, using `.astype(dates)` is not recommended. `pd.to_datetime()` is far better.

### Exercises

With a dataset of your choice:

In [45]:
url = "https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip"
df = pd.read_csv(url, low_memory=False)
city_mpg = df["city08"]
highway_mpg = df["highway08"]

1. Convert a numeric column to a smaller type.

In [46]:
city_mpg_32 = city_mpg.astype("int32")

2. Calculate the memory savings by converting to smaller numeric types.

In [47]:
print("Memory saved by conversion:", city_mpg.nbytes - city_mpg_32.nbytes)
print("Memory saved by conversion (including make):", 
      city_mpg.memory_usage(deep=True) - city_mpg_32.memory_usage(deep=True))

Memory saved by conversion: 164576
Memory saved by conversion (including make): 164576

3. Convert a string column into a categorical type.

In [48]:
strings_col = df["drive"]
cat_col = strings_col.astype("category")

4. Calculate the memory savings by converting to a categorical type.

In [49]:
print("Memory saved by conversion:", strings_col.nbytes - cat_col.nbytes)
print("Memory saved by conversion (including make):", 
      strings_col.memory_usage(deep=True) - cat_col.memory_usage(deep=True))

Memory saved by conversion: 287952
Memory saved by conversion (including make): 2986403

<a id='P9'></a>
## [Chapter 9: Manipulation Methods](#P0)

### Notes

- `.apply()`: allows you to apply a function element-wise to every value. Depending on what function it is used with, it can either be very useful or super slow. An example:

In [50]:
%%timeit

def gt20(val):
    return val > 20

city_mpg.apply(gt20)

3.69 ms ± 42.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [51]:
%%timeit

city_mpg.gt(20)

51.5 µs ± 14.6 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

**Note:** Using the pandas built in function directly is **much** faster than using basic python with `.apply()`!

- `.where()`: keeps values from the series it is called on where the boolean array is true, but where the boolean array is false, it uses the value of the second parameter. It can sometimes replace `.apply()`.

In [52]:
top5 = df["make"].value_counts().index[:5]

def generalize_top5(val):
    if val in top5:
        return val
    return "Other"

In [53]:
%%timeit

df["make"].apply(generalize_top5)

10.2 ms ± 1.84 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [54]:
%%timeit

df["make"].where(df["make"].isin(top5), other="Other")

1.42 ms ± 214 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

- `.mask()`: this is the complement of the `.where()` method. Where the condition is False, it keeps the original values; if it is True, it replaces the value with the other parameter.

In [55]:
df["make"].mask(df["make"].isin(top5), other="Top5")   # Replaces all the top 5 values

0        Alfa Romeo
1           Ferrari
2              Top5
3              Top5
4            Subaru
            ...
41139        Subaru
41140        Subaru
41141        Subaru
41142        Subaru
41143        Subaru
Name: make, Length: 41144, dtype: object

In [56]:
df["make"].mask(~df["make"].isin(top5), other="Other")   # negate the boolean and we get the same result as with .where

0        Other
1        Other
2        Dodge
3        Dodge
4        Other
         ...
41139    Other
41140    Other
41141    Other
41142    Other
41143    Other
Name: make, Length: 41144, dtype: object

Since `.mask()` is the opposite of `.where()`, we can ignore it and just use `.where()` with the required boolean array.

- **if else** phrases can be done in pandas with `.where()`, but if they go beyond two options, multiple `.where()` statements need to be chained together, which can easily get cumbersome. As an alternative, it is possible to use the `select` function from numpy, which allows a list of contidions and values in one call. An example:

In [57]:
# we want to keep values in top 5, mark those in top 10 with 'top10' and use 'Other' for the rest

vc = df["make"].value_counts()
top5 = vc.index[:5]
top10 = vc.index[:10]

In [58]:
# with apply - worst option

def generalize(val):
    if val in top5:
        return val
    elif val in top10:
        return "Top10"
    else:
        return "Other"
    
df["make"].apply(generalize)

0        Other
1        Other
2        Dodge
3        Dodge
4        Other
         ...
41139    Other
41140    Other
41141    Other
41142    Other
41143    Other
Name: make, Length: 41144, dtype: object

In [59]:
# with pandas method .where()

df["make"].where(df["make"].isin(top5), "Top10").where(df["make"].isin(top10), "Other")

0        Other
1        Other
2        Dodge
3        Dodge
4        Other
         ...
41139    Other
41140    Other
41141    Other
41142    Other
41143    Other
Name: make, Length: 41144, dtype: object

In [60]:
# with numpy function select

import numpy as np
pd.Series(np.select([df["make"].isin(top5), df["make"].isin(top10)], 
                    [df["make"], "Top10"], "Other"),
         index=df["make"].index)

0        Other
1        Other
2        Dodge
3        Dodge
4        Other
         ...
41139    Other
41140    Other
41141    Other
41142    Other
41143    Other
Length: 41144, dtype: object

- missing values: it is important to check for missing values and try to find out why they are missing.

In [61]:
# cylinders has missing values
df["cylinders"].isna().sum()

206

In [62]:
# check the make in those rows
missing = df["cylinders"].isna()
df["make"].loc[missing]

7138     Nissan
7139     Toyota
8143     Toyota
8144       Ford
8146       Ford
          ...
34563     Tesla
34564     Tesla
34565     Tesla
34566     Tesla
34567     Tesla
Name: make, Length: 206, dtype: object

**Note**: If we index `.loc[]` with a boolean array, it returns the rows where the boolean array is true.

- filling in missing data: in the example above it looks like the cylinder information is missing for electric cars. They don't have any cylinders, so we can fill the missing values with 0.

In [63]:
df["cylinders"].fillna("0").loc[7136:7141]

7136    6.0
7137    6.0
7138      0
7139      0
7140    6.0
7141    6.0
Name: cylinders, dtype: object

- `.interpolate` can also be used for filling in missing data, if the data is ordered (e.g. time series).

In [64]:
temp = pd.Series([32, 40, None, 42, 39, 32])
temp.interpolate()

0    32.0
1    40.0
2    41.0
3    42.0
4    39.0
5    32.0
dtype: float64

- `.clip` can be used to trim outliers from a Series to be within a specified range.

In [65]:
city_mpg.loc[:446]

0      19
1       9
2      23
3      10
4      17
       ..
442    15
443    15
444    15
445    15
446    31
Name: city08, Length: 447, dtype: int64

In [66]:
city_mpg.loc[:446].clip(
    lower=city_mpg.quantile(0.05), 
    upper=city_mpg.quantile(0.95))

0      19.0
1      11.0
2      23.0
3      11.0
4      17.0
       ...
442    15.0
443    15.0
444    15.0
445    15.0
446    27.0
Name: city08, Length: 447, dtype: float64

Note that the values outside the range do not get dropped, but rather adjusted to be within the bounds.

- `.sort_values` sorts values in ascending order and rearranges the index accordingly. Other math operations which include index alignment can still be performed on a sorted dataframe. It makes no difference, because the indices are matched before calculations are performed. You can use `na_position` to specify where you want NA values to appear.

In [67]:
(city_mpg+highway_mpg) / 2

0        22.0
1        11.5
2        28.0
3        11.0
4        20.0
         ...
41139    22.5
41140    24.0
41141    21.0
41142    21.0
41143    18.5
Length: 41144, dtype: float64

In [68]:
(city_mpg.sort_values() + highway_mpg) / 2

0        22.0
1        11.5
2        28.0
3        11.0
4        20.0
         ...
41139    22.5
41140    24.0
41141    21.0
41142    21.0
41143    18.5
Length: 41144, dtype: float64

- `.sort_index` does the reverse, it sorts the values by their index:

In [69]:
city_mpg.sort_values().sort_index()

0        19
1         9
2        23
3        10
4        17
         ..
41139    19
41140    20
41141    18
41142    18
41143    16
Name: city08, Length: 41144, dtype: int64

- `.drop_duplicates()` removes values that appear more than once. You can choose to remove the first or the last duplicated value, or all of them.

In [70]:
city_mpg.drop_duplicates()

0         19
1          9
2         23
3         10
4         17
        ...
34364    127
34409    114
34564    140
34565    115
34566    104
Name: city08, Length: 105, dtype: int64

- You can rank the values in a series with the `.rank()` method. It keeps the original index, but assigns a rank to each value. The ranking method can be controlled with the `method` parameter.

In [71]:
city_mpg.rank()

0        27060.5
1          235.5
2        35830.0
3          607.5
4        19484.0
          ...
41139    27060.5
41140    29719.5
41141    23528.0
41142    23528.0
41143    15479.0
Name: city08, Length: 41144, dtype: float64

- Map values to new values with the `.replace()` method. You can use a dictionary, two lists or just two strings (or regex).

In [72]:
df["make"].replace(to_replace={"Alfa Romeo":"AR", "Ferrari":"F", "Dodge":"D"})

0            AR
1             F
2             D
3             D
4        Subaru
          ...
41139    Subaru
41140    Subaru
41141    Subaru
41142    Subaru
41143    Subaru
Name: make, Length: 41144, dtype: object

In [73]:
df["make"].replace(to_replace=r"Alfa (Romeo)", value=r"\1 & Juliet", regex=True)

0        Romeo & Juliet
1               Ferrari
2                 Dodge
3                 Dodge
4                Subaru
              ...
41139            Subaru
41140            Subaru
41141            Subaru
41142            Subaru
41143            Subaru
Name: make, Length: 41144, dtype: object

- the function `pd.cut()` is useful for binning data. It returns a new series with the specified number of categories (with more or less the same bin width). It is also possible to provide the edges of the bins or to use `pd.qcut()` to bin the values into quantiles (more or less the same number of values in each bin).

In [74]:
city_mpg

0        19
1         9
2        23
3        10
4        17
         ..
41139    19
41140    20
41141    18
41142    18
41143    16
Name: city08, Length: 41144, dtype: int64

In [75]:
pd.cut(city_mpg, 10)

0        (5.856, 20.4]
1        (5.856, 20.4]
2         (20.4, 34.8]
3        (5.856, 20.4]
4        (5.856, 20.4]
             ...
41139    (5.856, 20.4]
41140    (5.856, 20.4]
41141    (5.856, 20.4]
41142    (5.856, 20.4]
41143    (5.856, 20.4]
Name: city08, Length: 41144, dtype: category
Categories (10, interval[float64, right]): [(5.856, 20.4] < (20.4, 34.8] < (34.8, 49.2] < (49.2, 63.6] ... (92.4, 106.8] < (106.8, 121.2] < (121.2, 135.6] < (135.6, 150.0]]

In [76]:
pd.qcut(city_mpg, 10)

0         (18.0, 20.0]
1        (5.999, 13.0]
2         (21.0, 24.0]
3        (5.999, 13.0]
4         (16.0, 17.0]
             ...
41139     (18.0, 20.0]
41140     (18.0, 20.0]
41141     (17.0, 18.0]
41142     (17.0, 18.0]
41143     (15.0, 16.0]
Name: city08, Length: 41144, dtype: category
Categories (10, interval[float64, right]): [(5.999, 13.0] < (13.0, 14.0] < (14.0, 15.0] < (15.0, 16.0] ... (18.0, 20.0] < (20.0, 21.0] < (21.0, 24.0] < (24.0, 150.0]]

You can also provide the labels for the bins.

In [77]:
pd.qcut(city_mpg, 4, labels=["bad", "ok", "good", "very good"])

0             good
1              bad
2        very good
3              bad
4               ok
           ...
41139         good
41140         good
41141         good
41142         good
41143           ok
Name: city08, Length: 41144, dtype: category
Categories (4, object): ['bad' < 'ok' < 'good' < 'very good']

### Exercises

With a dataset of your choice:

1) Create a series from a numeric column that has the value of 'high' if it is equal to or above the mean and 'low' if it is below the mean using `.apply`.

In [78]:
%time
city_mpg.apply(lambda x: "high" if x > city_mpg.mean() else "low")

CPU times: user 2 µs, sys: 0 ns, total: 2 µs
Wall time: 3.1 µs

0        high
1         low
2        high
3         low
4         low
         ...
41139    high
41140    high
41141     low
41142     low
41143     low
Name: city08, Length: 41144, dtype: object

2) Create a series from a numeric column that has the value of 'high' if it is equal to or above the mean and 'low' if it is below the mean using `np.select`.

In [79]:
%time
pd.Series(np.select([city_mpg > city_mpg.mean()], 
                    ["high"], 
                    default="low"))

CPU times: user 2 µs, sys: 0 ns, total: 2 µs
Wall time: 3.58 µs

0        high
1         low
2        high
3         low
4         low
         ...
41139    high
41140    high
41141     low
41142     low
41143     low
Length: 41144, dtype: object

3) Time the differences between the previous two solutions to see which is faster.

5.25 µs with `.apply()` vs. 2.86 µs with `np.select()`; the second option is almost twice as fast.

4) Replace the missing values of a numeric series with the median value.

In [80]:
random_series = pd.Series([np.nan] + np.random.rand(20).tolist() +  [np.nan])
random_series.fillna(random_series.median())

0     0.634374
1     0.959327
2     0.913345
3     0.743277
4     0.865577
5     0.780011
6     0.372173
7     0.316781
8     0.814646
9     0.415251
10    0.994123
11    0.614512
12    0.169706
13    0.463974
14    0.415677
15    0.650463
16    0.764570
17    0.618285
18    0.476430
19    0.679173
20    0.338534
21    0.634374
dtype: float64

5) Clip the values of a numeric series to between 10th and 90th percentiles.

In [81]:
city_mpg.clip(lower=city_mpg.quantile(0.1), upper=city_mpg.quantile(0.9))

0        19.0
1        13.0
2        23.0
3        13.0
4        17.0
         ...
41139    19.0
41140    20.0
41141    18.0
41142    18.0
41143    16.0
Name: city08, Length: 41144, dtype: float64

6) Using a categorical column, replace any value that is not in the top 5 most frequent values with 'Other'.

In [82]:
top5_fuel_types = df["fuelType"].value_counts().index[:5]
df["fuelType"].where(df["fuelType"].isin(top5_fuel_types), "Other")

0        Regular
1        Regular
2        Regular
3        Regular
4        Premium
          ...
41139    Regular
41140    Regular
41141    Regular
41142    Regular
41143    Premium
Name: fuelType, Length: 41144, dtype: object

7) Using a categorical column, replace any value that is not in the top 10 most frequent values with 'Other'.

In [83]:
top10_models = df["model"].value_counts().index[:10]
df["model"].where(df["model"].isin(top10_models), "Other")

0        Other
1        Other
2        Other
3        Other
4        Other
         ...
41139    Other
41140    Other
41141    Other
41142    Other
41143    Other
Name: model, Length: 41144, dtype: object

8) Make a function that takes a categorical series and a number (n) and returns a replace series that replaces any value that is not in the top n most frequent values with 'Other'.

In [84]:
def replace_small_categories(cat_series, n):
    
    top_n_cats = cat_series.value_counts().index[:n]
    new_cat_series = cat_series.where(cat_series.isin(top_n_cats), "Other")
    
    return new_cat_series

replace_small_categories(df["fuelType"], 3).value_counts()

Regular            26447
Premium            11542
Other               1838
Gasoline or E85     1317
Name: fuelType, dtype: int64

9) Using a numeric column, bin it into 10 groups that have the same width.

In [85]:
pd.cut(city_mpg, 10)

0        (5.856, 20.4]
1        (5.856, 20.4]
2         (20.4, 34.8]
3        (5.856, 20.4]
4        (5.856, 20.4]
             ...
41139    (5.856, 20.4]
41140    (5.856, 20.4]
41141    (5.856, 20.4]
41142    (5.856, 20.4]
41143    (5.856, 20.4]
Name: city08, Length: 41144, dtype: category
Categories (10, interval[float64, right]): [(5.856, 20.4] < (20.4, 34.8] < (34.8, 49.2] < (49.2, 63.6] ... (92.4, 106.8] < (106.8, 121.2] < (121.2, 135.6] < (135.6, 150.0]]

10) Using a numeric column, bin it into 10 groups that have equal sized bins.

In [86]:
pd.qcut(city_mpg, 10)

0         (18.0, 20.0]
1        (5.999, 13.0]
2         (21.0, 24.0]
3        (5.999, 13.0]
4         (16.0, 17.0]
             ...
41139     (18.0, 20.0]
41140     (18.0, 20.0]
41141     (17.0, 18.0]
41142     (17.0, 18.0]
41143     (15.0, 16.0]
Name: city08, Length: 41144, dtype: category
Categories (10, interval[float64, right]): [(5.999, 13.0] < (13.0, 14.0] < (14.0, 15.0] < (15.0, 16.0] ... (18.0, 20.0] < (20.0, 21.0] < (21.0, 24.0] < (24.0, 150.0]]

<a id='P10'></a>
## [Chapter 10: Indexing Operations](#P0)

### Notes

Main topics:
- changing the index
- accessing parts of a series using `[]`, `.loc[]` and `.iloc[]`
    
To avoid confusion, we use a series that has a string index, so that we can clearly distinguish between index position and index label.

In [87]:
city2 = city_mpg.rename(df["make"].to_dict())
city2

Alfa Romeo    19
Ferrari        9
Dodge         23
Dodge         10
Subaru        17
              ..
Subaru        19
Subaru        20
Subaru        18
Subaru        18
Subaru        16
Name: city08, Length: 41144, dtype: int64

In [88]:
city2.index

Index(['Alfa Romeo', 'Ferrari', 'Dodge', 'Dodge', 'Subaru', 'Subaru', 'Subaru',
       'Toyota', 'Toyota', 'Toyota',
       ...
       'Saab', 'Saturn', 'Saturn', 'Saturn', 'Saturn', 'Subaru', 'Subaru',
       'Subaru', 'Subaru', 'Subaru'],
      dtype='object', length=41144)

- resetting the index with `.reset_index()` returns a dataframe with monotonically increasing integers in the index, and the current index in a new column. To drop the current index, we can use `drop=True`. **Caution:** this affects operations that align on the index.

In [89]:
city2.reset_index(drop=True)

0        19
1         9
2        23
3        10
4        17
         ..
41139    19
41140    20
41141    18
41142    18
41143    16
Name: city08, Length: 41144, dtype: int64

**Slicing with `.loc` can be done with one of the following:**
- A scalar value of one of the index labels
- A list of index labels.
- A slice of labels
- An index
- A boolean array
- A function that accepts a series and returns one of the above

You pull out items by their **index label**.

In [90]:
indexing_df = df[["make", "city08"]].set_index("make")

In [91]:
# Cool trick
indexing_df.sort_index().loc["A":"C"]

            city08
make
AM General      13
AM General      18
AM General      13
AM General      16
AM General      13
...            ...
Buick           18
Buick           16
Buick           17
Buick           17
Buick           17

[4406 rows x 1 columns]

In [92]:
# Careful with duplicates!
print(indexing_df.loc[["Dodge"]].shape)
print(indexing_df.loc[["Dodge", "Dodge"]].shape)  # Twice as many values!!

(2583, 1)
(5166, 1)

In [93]:
# .loc also accepts functions:

(indexing_df["city08"]
 .mul(10)
 .loc[lambda x: x > 200]
)

make
Dodge      230
Subaru     210
Subaru     220
Toyota     230
Toyota     230
          ...
Pontiac    260
Saturn     230
Saturn     210
Saturn     240
Saturn     210
Name: city08, Length: 10272, dtype: int64

In [94]:
mask = indexing_df["city08"] > 200

(indexing_df["city08"]
 .mul(10)
 .loc[mask]
)

Series([], Name: city08, dtype: int64)

**Slicing with `.iloc`:**

You pull out items by their **index position**. Index positions are always unique.

In [95]:
city2.iloc[0]  # returns a value

19

In [96]:
city2.iloc[[0, 1, 2]]  # returns a series

Alfa Romeo    19
Ferrari        9
Dodge         23
Name: city08, dtype: int64

In [97]:
# To use a boolean, we need to convert it to a numpy array or python list

mask = city2 > 50

city2.iloc[mask.to_numpy()]

Nissan     81
Toyota     81
Toyota     81
Ford       74
Nissan     84
         ...
Tesla     140
Tesla     115
Tesla     104
Tesla      98
Toyota     55
Name: city08, Length: 236, dtype: int64

**Sampling!!**

In [98]:
city2.sample(10, random_state=31)

Volvo            16
BMW              20
Toyota           20
Nissan           15
Mercedes-Benz    18
Audi             13
Kia              22
Toyota           17
Pontiac          15
Ford             13
Name: city08, dtype: int64

**Filtering:**

Can be done with items (exact match), like (substring) or regex.

In [99]:
city2.filter(like="lf")

Alfa Romeo    19
Alfa Romeo    19
Alfa Romeo    14
Alfa Romeo    15
Alfa Romeo    14
              ..
Alfa Romeo    19
Alfa Romeo    19
Alfa Romeo    16
Alfa Romeo    16
Alfa Romeo    15
Name: city08, Length: 62, dtype: int64

In [100]:
city2.filter(regex="lf|Ford")

Alfa Romeo    19
Ford          18
Ford          16
Ford          17
Ford          17
              ..
Ford          26
Ford          19
Ford          21
Ford          18
Ford          19
Name: city08, Length: 3433, dtype: int64

**Reindexing:**

In [101]:
series_1 = highway_mpg.iloc[[2,6,7,15,78]]
series_1

2     33
6     29
7     26
15    28
78    24
Name: highway08, dtype: int64

In [102]:
series_2 = city_mpg.iloc[[2,7,14,15,75,78]]
series_2

2     23
7     23
14    12
15    20
75    21
78    18
Name: city08, dtype: int64

In [103]:
# Make sure two series have the same index
series_2.reindex(series_1.index)

2     23.0
6      NaN
7     23.0
15    20.0
78    18.0
Name: city08, dtype: float64

### Exercises

With a dataset of your choice:

1) Inspect the index.

In [104]:
indexing_df.index

Index(['Alfa Romeo', 'Ferrari', 'Dodge', 'Dodge', 'Subaru', 'Subaru', 'Subaru',
       'Toyota', 'Toyota', 'Toyota',
       ...
       'Saab', 'Saturn', 'Saturn', 'Saturn', 'Saturn', 'Subaru', 'Subaru',
       'Subaru', 'Subaru', 'Subaru'],
      dtype='object', name='make', length=41144)

2) Sort the index.

In [105]:
indexing_df.sort_index(ascending=False)

            city08
make
smart           34
smart           33
smart           33
smart           34
smart           34
...            ...
AM General      16
AM General      13
AM General      18
AM General      13
AM General      13

[41144 rows x 1 columns]

3) Set the index to monotonically increasing integers starting from 0.

In [106]:
indexing_df.reset_index()

             make  city08
0      Alfa Romeo      19
1         Ferrari       9
2           Dodge      23
3           Dodge      10
4          Subaru      17
...           ...     ...
41139      Subaru      19
41140      Subaru      20
41141      Subaru      18
41142      Subaru      18
41143      Subaru      16

[41144 rows x 2 columns]

4) Set the index to monotonically increasing integers starting from 0, then convert these to the string version. Save this as `s2`.

In [107]:
s2 = indexing_df.reset_index()
s2.index = s2.index.map(str)
s2.index

Index(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
       ...
       '41134', '41135', '41136', '41137', '41138', '41139', '41140', '41141',
       '41142', '41143'],
      dtype='object', length=41144)

5) Using `s2`, pull out the first 5 entries.

In [108]:
s2.iloc[:5,:]

         make  city08
0  Alfa Romeo      19
1     Ferrari       9
2       Dodge      23
3       Dodge      10
4      Subaru      17

In [109]:
s2.loc[:"4",:]

         make  city08
0  Alfa Romeo      19
1     Ferrari       9
2       Dodge      23
3       Dodge      10
4      Subaru      17

6) Using `s2`, pull out the last 5 entries.

In [110]:
s2.tail()

         make  city08
41139  Subaru      19
41140  Subaru      20
41141  Subaru      18
41142  Subaru      18
41143  Subaru      16

In [111]:
s2.iloc[-5:,:]

         make  city08
41139  Subaru      19
41140  Subaru      20
41141  Subaru      18
41142  Subaru      18
41143  Subaru      16

7) Using `s2`, pull out one hundred entries starting at index position 10.

In [112]:
s2.loc["10":"109",:]

           make  city08
10       Toyota      23
11   Volkswagen      18
12   Volkswagen      21
13   Volkswagen      18
14        Dodge      12
..          ...     ...
105      Toyota      16
106      Toyota      16
107  Volkswagen      18
108  Volkswagen      18
109  Volkswagen      15

[100 rows x 2 columns]

In [113]:
s2.iloc[10:110,:]

           make  city08
10       Toyota      23
11   Volkswagen      18
12   Volkswagen      21
13   Volkswagen      18
14        Dodge      12
..          ...     ...
105      Toyota      16
106      Toyota      16
107  Volkswagen      18
108  Volkswagen      18
109  Volkswagen      15

[100 rows x 2 columns]

8) Using `s2`, create a series with values with index entries `'20'`, `'10'`, and `'2'`.

In [114]:
s2.loc[["20", "10", "2"],:]

      make  city08
20     BMW      14
10  Toyota      23
2    Dodge      23

<a id='P11'></a>
## [Chapter 11: String Manipulation](#P0)

### Notes

Most string manipulation methods are available for both string and category data types. Using the category type is more memory efficient, though.

In [115]:
make = df["make"]
make.str.lower()

0        alfa romeo
1           ferrari
2             dodge
3             dodge
4            subaru
            ...
41139        subaru
41140        subaru
41141        subaru
41142        subaru
41143        subaru
Name: make, Length: 41144, dtype: object

In [116]:
make.str.find("ub")

0       -1
1       -1
2       -1
3       -1
4        1
        ..
41139    1
41140    1
41141    1
41142    1
41143    1
Name: make, Length: 41144, dtype: int64

In [117]:
make.str.startswith("Al")

0         True
1        False
2        False
3        False
4        False
         ...
41139    False
41140    False
41141    False
41142    False
41143    False
Name: make, Length: 41144, dtype: bool

String methods in pandas work much the same way as string methods in Python in general. It is also possible to combine regex with pandas string methods.

In [118]:
make.str.extract(r'([^a-z])').head()  # Remove all lower case characters

   0
0  A
1  F
2  D
3  D
4  S

In [120]:
# Look for non-numeric characters in a numeric column (-> clean them)

new_city = copy.deepcopy(df["city08"])
new_city.iloc[[1, 44, 56, 100],] = "/-6"
new_city.str.extract(r'([^0-9.])', expand=False).value_counts()

/    4
Name: city08, dtype: int64

- splitting binned values (e.g. from survey data):

In [121]:
age = pd.Series(["0-10", "20-30", "20-30", "60-70", "40-50", "20-30", "10-20", "40-50", "30-40"])
age.str.split("-", expand=True).iloc[:,0].astype(int)  # Take the lower boundary

0     0
1    20
2    20
3    60
4    40
5    20
6    10
7    40
8    30
Name: 0, dtype: int64

In [122]:
age.str.split("-", expand=True).astype(int).mean(axis="columns")   # Take the mean of each bin

0     5.0
1    25.0
2    25.0
3    65.0
4    45.0
5    25.0
6    15.0
7    45.0
8    35.0
dtype: float64

**How to make `.apply()` less slow?**

- transform pandas series into numpy arrays
- use cython
- explicitly define data types

What is the difference between `.str.replace()` and `.replace()`?

In [125]:
make.str.replace("A", "Ä").head()  # This looks for 'A' in each string.

0    Älfa Romeo
1       Ferrari
2         Dodge
3         Dodge
4        Subaru
Name: make, dtype: object

In [126]:
make.replace("A", "Ä").head()   # This looks for a string 'A'.

0    Alfa Romeo
1       Ferrari
2         Dodge
3         Dodge
4        Subaru
Name: make, dtype: object

In [129]:
make.replace("A", "Ä", regex=True)

0        Älfa Romeo
1           Ferrari
2             Dodge
3             Dodge
4            Subaru
            ...
41139        Subaru
41140        Subaru
41141        Subaru
41142        Subaru
41143        Subaru
Name: make, Length: 41144, dtype: object

In [128]:
make.replace("Alfa Romeo", "Älfa Romeo")   # This method works with a dictionary as well.

0        Älfa Romeo
1           Ferrari
2             Dodge
3             Dodge
4            Subaru
            ...
41139        Subaru
41140        Subaru
41141        Subaru
41142        Subaru
41143        Subaru
Name: make, Length: 41144, dtype: object

There are many other less well-known string operations in pandas. However, string methods are generally slow in pandas, because they are not vectorized.

In [132]:
make.str.center(10, fillchar="-")

0        Alfa Romeo
1        -Ferrari--
2        --Dodge---
3        --Dodge---
4        --Subaru--
            ...
41139    --Subaru--
41140    --Subaru--
41141    --Subaru--
41142    --Subaru--
41143    --Subaru--
Name: make, Length: 41144, dtype: object

In [137]:
make.loc[:10].str.cat(sep=" *-* ")

'Alfa Romeo *-* Ferrari *-* Dodge *-* Dodge *-* Subaru *-* Subaru *-* Subaru *-* Toyota *-* Toyota *-* Toyota *-* Toyota'

In [139]:
make.str.get(4)

0
1        a
2        e
3        e
4        r
        ..
41139    r
41140    r
41141    r
41142    r
41143    r
Name: make, Length: 41144, dtype: object

In [142]:
make.str.partition(" ")

             0  1      2
0         Alfa     Romeo
1      Ferrari
2        Dodge
3        Dodge
4       Subaru
...        ... ..    ...
41139   Subaru
41140   Subaru
41141   Subaru
41142   Subaru
41143   Subaru

[41144 rows x 3 columns]

### Exercises

With a dataset of your choice:

1. Using a string column, lowercase the values.

In [143]:
make.str.lower()

0        alfa romeo
1           ferrari
2             dodge
3             dodge
4            subaru
            ...
41139        subaru
41140        subaru
41141        subaru
41142        subaru
41143        subaru
Name: make, Length: 41144, dtype: object

2. Using a string column, slice out the first character.

In [148]:
make.str.slice(0, 1)

0        A
1        F
2        D
3        D
4        S
        ..
41139    S
41140    S
41141    S
41142    S
41143    S
Name: make, Length: 41144, dtype: object

3. Using a string column, slice out the last three characters.

In [152]:
make.str.slice(-3)

0        meo
1        ari
2        dge
3        dge
4        aru
        ...
41139    aru
41140    aru
41141    aru
41142    aru
41143    aru
Name: make, Length: 41144, dtype: object

4. Using a string column, create a series extracting the numeric values.

In [166]:
drive = df["drive"]
drive.str.extract(r'([^a-zA-Z- ])', expand=False).value_counts()

4    8366
2     507
Name: drive, dtype: int64

5. Using a string column, create a series extracting the non-ASCII values.

In [174]:
drive

0                  Rear-Wheel Drive
1                  Rear-Wheel Drive
2                 Front-Wheel Drive
3                  Rear-Wheel Drive
4        4-Wheel or All-Wheel Drive
                    ...
41139             Front-Wheel Drive
41140             Front-Wheel Drive
41141    4-Wheel or All-Wheel Drive
41142    4-Wheel or All-Wheel Drive
41143    4-Wheel or All-Wheel Drive
Name: drive, Length: 41144, dtype: object

In [199]:
drive2 = df["drive"]
drive2 = drive2.str.replace("A", "à%%$ä")

drive2.str.extractall(r'([^x00-x7F])').value_counts()

     53509
-    46861
%    19326
$     9663
à     9663
ä     9663
dtype: int64

6. Using a string column, create a dataframe with the dummy columns for every character in the column.

In [201]:
make.str.get_dummies()

,AM General,ASC Incorporated,Acura,Alfa Romeo,American Motors Corporation,Aston Martin,Audi,Aurora Cars Ltd,Autokraft Limited,Avanti Motor Corporation,...,Toyota,VPG,Vector,Vixen Motor Company,Volga Associated Automobile,Volkswagen,Volvo,Wallace Environmental,Yugo,smart
0,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41139,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
41140,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
41141,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
41142,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
41143,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

<a id='P12'></a>
## [Chapter 12: Date and Time Manipulation](#P0)

### Notes

### Exercises